# Data Science Class - Learning Data Munging Basics

Segment 1 - Filtering and selecting the data

importing numpy and pandas packages.

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

# Selecting and retrieving data
https://pandas.pydata.org/pandas-docs/stable/indexing.html

Create a Series object and print contents in it.
NB: it is arange. not arrange.

In [3]:
series_obj = Series(np.arange(5), index=[
    'Row 1',
    'Row 2',
    'Row 3',
    'Row 4',
    'Row 5'    
])

series_obj

Row 1    0
Row 2    1
Row 3    2
Row 4    3
Row 5    4
dtype: int32

In [4]:
#Selecting a particular row from the above data set
#['label-index']

series_obj['Row 3']

2

In [13]:
# If you pass an integer index. It will do the same (It is 0 based, as expected from our known programming languages)
#['integer-index']
series_obj[2]

# You can select multiple data at the same time - uncomment to see
#series_obj[[1, 3]]

2

Using Random Number generator for data frame object

In [22]:
#seeding a number
np.random.seed(32)
#creating an object
dataframe_obj = DataFrame(np.random.rand(49).reshape((7, 7)), index=[
    'Row 1',
    'Row 2',
    'Row 3',
    'Row 4',
    'Row 5',
    'Row 6',
    'Row 7'
], columns=[
    'Column 1',
    'Column 2',
    'Column 3',
    'Column 4',
    'Column 5',
    'Column 6',
    'Column 7'
])

dataframe_obj

       Column 1  Column 2  Column 3  Column 4  Column 5  Column 6  Column 7
Row 1  0.858889  0.372711  0.555129  0.955657  0.736670  0.816205  0.101087
Row 2  0.928488  0.609109  0.596553  0.091784  0.345186  0.662753  0.441713
Row 3  0.551488  0.703712  0.589401  0.049933  0.561792  0.766358  0.910908
Row 4  0.092910  0.902521  0.460960  0.452018  0.999425  0.162424  0.709371
Row 5  0.160624  0.810777  0.035147  0.534887  0.166500  0.308410  0.045062
Row 6  0.238576  0.674835  0.782383  0.695202  0.328954  0.494032  0.524121
Row 7  0.298541  0.463108  0.984784  0.501135  0.398072  0.727905  0.863331

In [25]:
#Get data from the above data frame
#Fetching data for the specified rows and columns

dataframe_obj.ix[['Row 1', 'Row 3'], ['Column 5', 'Column 6']]

       Column 5  Column 6
Row 1  0.736670  0.816205
Row 3  0.561792  0.766358

# Data Slicing

In [26]:
#Data slicing allows you to select portions of your dataset.
#[starting-label-index : ending-label-index]
series_obj['Row 2' : 'Row 4']

Row 2    1
Row 3    2
Row 4    3
dtype: int32

# Comparing with Scalars

In [27]:
dataframe_obj < 0.2

       Column 1  Column 2  Column 3  Column 4  Column 5  Column 6  Column 7
Row 1     False     False     False     False     False     False      True
Row 2     False     False     False      True     False     False     False
Row 3     False     False     False      True     False     False     False
Row 4      True     False     False     False     False      True     False
Row 5      True     False      True     False      True     False      True
Row 6     False     False     False     False     False     False     False
Row 7     False     False     False     False     False     False     False

# Filtering with scalar values

In [28]:
dataframe_obj[dataframe_obj > 0.5]

       Column 1  Column 2  Column 3  Column 4  Column 5  Column 6  Column 7
Row 1  0.858889       NaN  0.555129  0.955657  0.736670  0.816205       NaN
Row 2  0.928488  0.609109  0.596553       NaN       NaN  0.662753       NaN
Row 3  0.551488  0.703712  0.589401       NaN  0.561792  0.766358  0.910908
Row 4       NaN  0.902521       NaN       NaN  0.999425       NaN  0.709371
Row 5       NaN  0.810777       NaN  0.534887       NaN       NaN       NaN
Row 6       NaN  0.674835  0.782383  0.695202       NaN       NaN  0.524121
Row 7       NaN       NaN  0.984784  0.501135       NaN  0.727905  0.863331

# Setting Values with Scalars

In [31]:
#Single or multiple- anything would work
series_obj['Row 3', 'Row 4'] = 59

In [32]:
series_obj

Row 1     0
Row 2     1
Row 3    59
Row 4    59
Row 5     4
dtype: int32